app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ?  ORDER BY "accounts"."id" ASC LIMIT 1  [["id", 5]]
---
    def set_account
      @account = Account.find(params[:id])