app/controllers/departments_controller.rb

  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save
---
INSERT INTO "departments" ("role", "created_at", "updated_at") VALUES (?, ?, ?)  [["role", "Administrator"], ["created_at", "2020-05-18 19:28:14.070690"], ["updated_at", "2020-05-18 19:28:14.070690"]]