app/controllers/employees_controller.rb

UPDATE "employees" SET "shop_id" = ?, "department_id" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["shop_id", 0], ["department_id", 2], ["updated_at", "2020-05-19 21:41:28.428201"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 3]]
SELECT "departments".* FROM "departments"
SELECT "shops".* FROM "shops"
---
    def set_employee
      if params[:id]
        @employee = Employee.find(params[:id])
      end

      @departments = Department.where.not(role: "Administrator")
      if current_account.employee.department.role == "Administrator"
        @departments = Department.all
      end

      @shops = Shop.all