app/controllers/items_controller.rb

INSERT INTO "items" ("name", "descripton", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Cat"], ["descripton", "It can meow"], ["price", 1.0], ["created_at", "2020-05-19 22:19:16.100690"], ["updated_at", "2020-05-19 22:19:16.100690"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save