app/controllers/receipts_controller.rb

  def index
    @receipts = Receipt.all
---
SELECT "receipts".* FROM "receipts"

  def new
    if current_account.employee.shop == nil
      redirect_to({action: "index"}, alert: "You should have a shop assigned to you in order to create receipts.")
      return
    end
    @receipt = Receipt.new
    @receipt.shop = current_account.employee.shop
    @receipt.employee = current_account.employee
    @all_items = Item.all
---
SELECT "items".* FROM "items"

  def create
    @receipt = Receipt.new(receipt_params)

    respond_to do |format|
      if @receipt.save
---
INSERT INTO "receipts" ("shop_id", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["shop_id", 2], ["employee_id", 3], ["created_at", "2020-05-19 21:54:12.690924"], ["updated_at", "2020-05-19 21:54:12.690924"]]

    def set_receipt
      @receipt = Receipt.find(params[:id])
      @all_items = Item.all
---
SELECT  "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items"