app/controllers/shops_controller.rb

  def create
    @shop = Shop.new(shop_params)

    respond_to do |format|
      if @shop.save
---
INSERT INTO "shops" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Vopak 1"], ["created_at", "2020-05-19 21:36:03.546760"], ["updated_at", "2020-05-19 21:36:03.546760"]]

    def set_shop
      @shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 1]]